app/controllers/sales_orders_controller.rb

SELECT  "sales_orders".* FROM "sales_orders" LIMIT 30 OFFSET 0
---
  def index
    @sosss = SalesOrder.paginate(page: params[:page])

SELECT  "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @soss = SalesOrder.find(params[:id])

INSERT INTO "sales_orders" ("due_date", "bill_to", "requestor_name", "title", "address", "email", "origin_port", "dest_port", "mode", "service_level", "shipper_name", "shipper_address", "importer_of_record", "customs_origin_broker", "customs_dest_broker", "origin_airport", "actual_weight", "uom", "pcs", "dimensions_length", "dimensions_width", "dimensions_height", "chargeable_weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25) RETURNING "id"
---
  def create
    @soss = SalesOrder.new(soss_params)
    if @soss.save

SELECT  "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @soss = SalesOrder.find(params[:id])

SELECT  "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "sales_orders" SET "requestor_name" = $1, "updated_at" = $2 WHERE "sales_orders"."id" = $3  [["requestor_name", "keenan"], ["updated_at", "2015-06-10 04:53:20.284593"], ["id", 7]]
---
  def update
    @soss = SalesOrder.find(params[:id])
    if @soss.update_attributes(soss_params)