app/controllers/static_pages_controller.rb

SELECT "sales_orders".* FROM "sales_orders"
---
  def home
  @unfinishedsosss = []
    SalesOrder.all.each do |order|